podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SIM_MKE04Z4.svd.xml
            <register>
               <name>PINSEL</name>
               <description>Pin Selection Register</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>I2C0PS</name>
                     <description>I2C0 Port Pin Select</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>I2C0_SCL and I2C0_SDA are mapped on PTA3 and PTA2, respectively</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>I2C0_SCL and I2C0_SDA are mapped on PTB7 and PTB6, respectively</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPI0PS</name>
                     <description>SPI0 Pin Select\n
Selects the SPI0 Pinouts</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>SPI0_SCK, SPI0_MOSI, SPI0_MISO, and SPI0_PCS are mapped on PTB2, PTB3, PTB4, and PTB5</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>SPI0_SCK, SPI0_MOSI, SPI0_MISO, and SPI0_PCS are mapped on PTA6, PTA7, PTB1, and PTB0</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UART0PS</name>
                     <description>UART0 Pin Select</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>UART0_RX and UART0_TX are mapped on PTB0 and PTB1</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>UART0_RX and UART0_TX are mapped on PTA2 and PTA3</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM0PS0</name>
                     <description>FTM0 channel 0 Port Pin Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>FTM0 channel 0 is mapped on PTA0</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>FTM0 channel 0 is mapped on PTB2</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM0PS1</name>
                     <description>FTM0 channel 1 Port Pin Select</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>FTM0 channel 1 is mapped on PTA1</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>FTM0 channel 1 is mapped on PTB3</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM2PS2</name>
                     <description>FTM2 channel 2 Port Pin Select</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Mapped on PTC2</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Mapped on PTC4</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM2PS3</name>
                     <description>FTM2 channel 3 Port Pin Select</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Mapped on PTC3</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Mapped on PTC5</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM0CLKPS</name>
                     <description>FTM0 TCLK Pin Select: Selects the TCLK pinout</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Selects TCLK1 for FTM0 module</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Selects TCLK2 for FTM0 module</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM2CLKPS</name>
                     <description>FTM2 TCLK Pin Select: Selects the TCLK pinout</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Selects TCLK1 for FTM2 module</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Selects TCLK2 for FTM2 module</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PWTCLKPS</name>
                     <description>PWT TCLK Pin Select: Selects the TCLK pinout</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Selects TCLK1 for PWT module</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Selects TCLK2 for PWT module</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCGC</name>
               <description>System Clock Gating Control Register</description>
               <addressOffset>0xC</addressOffset>
               <resetValue>0x3000</resetValue>
               <fields>
                  <field>
                     <name>RTC</name>
                     <description>RTC Clock Gate Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Clock disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clock enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="RTC" > <name>PIT</name> <description>PIT Clock Gate Control</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>PWT</name> <description>PWT Clock Gate Control</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>FTM0</name> <description>FTM0 Clock Gate Control</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>FTM2</name> <description>FTM2 Clock Gate Control</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>CRC</name> <description>CRC Clock Gate Control</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>FLASH</name> <description>FLASH Clock Gate Control</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>SWD</name> <description>SWD Clock Gate Control</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>I2C</name> <description>I2C1 Clock Gate Control</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>SPI0</name> <description>SPI0 Clock Gate Control</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>UART0</name> <description>UART0 Clock Gate Control</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>KBI0</name> <description>KBI0 Clock Gate Control</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>KBI1</name> <description>KBI1 Clock Gate Control</description> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>IRQ</name> <description>IRQ Clock Gate Control</description> <bitOffset>27</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>ADC0</name> <description>ADC Clock Gate Control</description> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>ACMP0</name> <description>ACMP0 Clock Gate Control</description> <bitOffset>30</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>ACMP1</name> <description>ACMP1 Clock Gate Control</description> <bitOffset>31</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>UUIDL</name>
               <description>Universally Unique Identifier Low Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>read-write</access>
            </register>
            <register>
               <name>UUIDH</name>
               <description>Universally Unique Identifier Middle Low Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>read-write</access>
            </register>
            <register>
               <name>UUIDMH</name>
               <description>Universally Unique Identifier Middle High Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <access>read-write</access>
            </register>
            <register>
               <name>CLKDIV</name>
               <description>BUS Clock Divider Register</description>
               <addressOffset>0x1C</addressOffset>
               <fields>
                  <field>
                     <name>OUTDIV3</name>
                     <description>Clock 3 Output Divider value\n
This field sets the divide value for the timers(FTM0, FTM2,PWT)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>ICSOUTCLK</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>ICSOUTCLK/2</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OUTDIV2</name>
                     <description>Clock 2 Output Divider value\n
This field sets the divide value for the bus/FLASH, follows OUTDIV1</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not divided from divider1</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Divide by 2 from divider1</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OUTDIV1</name>
                     <description>Clock 1 Output Divider value\n
This field sets the divide value for the core/system clock</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>ICSOUTCLK</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>ICSOUTCLK/2</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>ICSOUTCLK/3</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>ICSOUTCLK/4</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
